LEXICON_RU = {
    'sync_mine' : '--- СИНХРОНИЗАЦИЯ МИРОВ МАЙНКРАФТ ---'
    '\n1 - Начать игру(загрузить сервер из облака)'
    '\n2 - Закончить игру(Отправить сервер в облако)'
    '\n3 - Присоединиться к северу(скопировать айпи)'
    '\n0 - Закрыть программу\n',

    'no_cloud_folder': 'Ошибка: не удалось найти вашу общую папку серверов "Minecraft_shared" на майл диске'
    '\nДля выхода из программы напишите "0"\n'
    '\nУкажите путь до папки "Minecraft_shared" в майл диска: ',

    'choice': 'Выберите действие 1/2/3/0: \n',
    'bad_choice': 'Вы выбрали неправильный вариант действия, попробуйте снова.',

    'del_old_files_server': '\nУдаление старых файлов сервера...',
    'install_folder_server': '\nСкачивается папка сервера из облака...',
    'ready_server': 'ГОТОВО! Сервер скачан, ты - хост, запускай start.bat скорее!!!\n',

    'exit': '\nНажмите клавишу 0 для выхода из программы\nДля выхода в главное меню нажмите Enter\n',

    'create_backup': '\nСоздание бэкапа...',
    'created_backup': 'Резервный бэкап создан!',
    'del_backup': 'Самый старый бэкап удалён для экономии места',

    'make_archive': '\nАрхивация и отправка мира в облако...',
    'loaded_archive': 'ГОТОВО! Мир успешно обновлен и загружен друзьям в облако\n',

    'old_java': '[Внимание] У вас слишком старая версия java 8! Для запуска сервера нужна java 21 или выше',
    'no_java': '[Внимание] Не было найдено java в вашей системе.',
    'find_java': 'Ищу java в вашей системе и по стандартным путям лаунчеров...',
    'input_path_to_java': '\nНесуществующий путь, попробуйте еще раз указать путь к папке с java.exe'
    '\nДля выхода из программы напишите "0": ',
    'not_found_java.exe': "\nОшибка: Файл java.exe не найден в указанной папке!\n",

    'error_java': '\nОшибка: подходящая версия Java не найдена!\n'
    'Укажите путь до папки джавы из файлов вашего лаунчера\n'
    '(она будет называться bin и находиться в папках с названием java-runtime-delta например)\n\n'
    'Или отправьте "i" и у вас откроятся страница скачивания Java 25 и небольшая документация\n\n'
    'Для выхода в главное меню нажмите Enter, или 0 для выхода из программы\n',

    'link_java25': 'https://adoptium.net/temurin/releases?version=25&os=any&arch=any',
    'link_docs_java25': 'https://docs.fabricmc.net/players/installing-java/windows#3-run-the-installer',

    'install_java': 'Используя документацию установите себе на компьютер Java и перезапустите скрипт',

    'server_running': 'Ошибка: сервер уже запущен на вашем компьютере!\n'
    'Завершите работу сервера командой stop, затем повторите дейстиве.\n',
    'error_launch': '\n\nОшибка доступа! Сервер уже запущен на другом компьютере.\nТолько текущий хост имеет право завершить игру.',
    'ctrlv_in_mine': 'В майнкрафте нажмите "Ctrl + V" в поле адреса сервера.\n',
    'not_server': '\nСервер сейчас не запущен! Попробуйте позже, или запустите сервер.\n',
}